org-init/toby-mode.org
#+SETUPFILE: ~/.emacs.d/org-init/level-0.orgsetup
* Toby Mode
  I made a minor-mode to capture some features and key-bindings that I
  think might bother another experienced Emacs user.  This way I can
  turn those bits off should the need arise.

** Setup
   Make some common-lisp-isms available:
   #+BEGIN_SRC emacs-lisp
   (eval-when-compile (require 'cl))
   #+END_SRC

   I still use a couple functions from the old TextMate package:
   #+BEGIN_SRC emacs-lisp
   (require-package 'textmate)
   (require 'textmate)
   #+END_SRC

