org-init/toby-mode.org
** Commands
   Use =tramp= to re-open a file with more privileges:
   #+BEGIN_SRC emacs-lisp
   (defun sudo-file ()
     "Re-open the current buffer's file with sudo"
     (interactive)
     (let ((p (point)))
       (find-alternate-file
        (concat "/sudo::" (buffer-file-name)))
           (goto-char p)))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
   (defun duplicate-line ()
     "Duplicate the current line"
     (interactive)
     (save-excursion
       (move-beginning-of-line 1)
       (kill-line)
       (yank)
       (open-line 1)
       (next-line 1)
       (yank)))
   #+END_SRC

   Sometimes, like inside some shells, you might find yourself wanting
   to swap the Meta and Super modifiers.  This command lets you do that:
   #+BEGIN_SRC emacs-lisp
   (defun swap-modifiers ()
     "Swap meta and super"
     (interactive)
     (cond
      ((equal ns-command-modifier 'super)
       (setq ns-command-modifier   'meta
             ns-alternate-modifier 'super)
       (message "Command is Meta"))
      (t
       (setq ns-command-modifier   'super
             ns-alternate-modifier 'meta)
       (message "Alt is Meta"))))
   #+END_SRC

   New-line and indent from anywhere in the current line:
   #+BEGIN_SRC emacs-lisp
   (defun toby/open-line ()
     "Insert a newline after the current line and move down"
     (interactive)
     (end-of-visual-line)
     (newline-and-indent))
   #+END_SRC

   Save all buffers while updating the modification time of the
   current buffer's file.  This is handy if you're using something
   like [[https://github.com/guard/guard][Guard]] to automatically run unit tests.
   #+BEGIN_SRC emacs-lisp
   (defun touch ()
     "update the mtime of the file for the current buffer"
     (interactive)
     (save-some-buffers 'no-confirm)
     (shell-command (concat "touch "
                            (shell-quote-argument (buffer-file-name))))
     (clear-visited-file-modtime)
     (message "I'm touched"))
   #+END_SRC

   Increment a number at the point:
   #+BEGIN_SRC emacs-lisp
   (defun toby/increment-number-at-point (&optional arg)
     "Increment the decimal number at point by 'arg'."
     (interactive "p*")
     (save-excursion
       (save-match-data
         (let ((number (number-at-point))
               (inc-by (if arg arg 1)))
           (when number
             (progn
               (forward-word)
               (search-backward (number-to-string number))
               (replace-match (number-to-string (+ number inc-by)))))))))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
   (defun toby/align-columns (start end regexp)
     "Align text in columns according to `regexp'"
     (interactive "r\nsAlign regexp: ")
     (align-regexp start end
                   (concat "\\(\\s-*\\)" regexp) 1 1 t))
   #+END_SRC
