toby-mode.html

<div id="outline-container-orgedeaac9" class="outline-3">
<h3 id="orgedeaac9">Commands</h3>
<div class="outline-text-3" id="text-orgedeaac9">
<p>
Use <code>tramp</code> to re-open a file with more privileges:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">sudo-file</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Re-open the current buffer's file with sudo"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>p <span style="color: #cb4b16;">(</span>point<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>find-alternate-file
     <span style="color: #dc322f;">(</span>concat <span style="color: #2aa198;">"/sudo::"</span> <span style="color: #cb4b16;">(</span>buffer-file-name<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>goto-char p<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">duplicate-line</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Duplicate the current line"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">save-excursion</span>
    <span style="color: #268bd2;">(</span>move-beginning-of-line 1<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>kill-line<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>yank<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>open-line 1<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>next-line 1<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>yank<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Sometimes, like inside some shells, you might find yourself wanting
to swap the Meta and Super modifiers.  This command lets you do that:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">swap-modifiers</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Swap meta and super"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
   <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>equal ns-command-modifier 'super<span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">setq</span> ns-command-modifier   'meta
          ns-alternate-modifier 'super<span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span>message <span style="color: #2aa198;">"Command is Meta"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>t
    <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">setq</span> ns-command-modifier   'super
          ns-alternate-modifier 'meta<span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span>message <span style="color: #2aa198;">"Alt is Meta"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
New-line and indent from anywhere in the current line:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/open-line</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Insert a newline after the current line and move down"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>end-of-visual-line<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>newline-and-indent<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Save all buffers while updating the modification time of the
current buffer's file.  This is handy if you're using something
like <a href="https://github.com/guard/guard">Guard</a> to automatically run unit tests.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">touch</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"update the mtime of the file for the current buffer"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>save-some-buffers 't<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>shell-command <span style="color: #268bd2;">(</span>concat <span style="color: #2aa198;">"touch "</span>
                         <span style="color: #dc322f;">(</span>shell-quote-argument <span style="color: #cb4b16;">(</span>buffer-file-name<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>clear-visited-file-modtime<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>message <span style="color: #2aa198;">"I'm touched"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Increment a number at the point:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/increment-number-at-point</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">&amp;optional</span> arg<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Increment the decimal number at point by 'arg'."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span> <span style="color: #2aa198;">"p*"</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">save-excursion</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">save-match-data</span>
      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #cb4b16;">(</span><span style="color: #268bd2;">(</span>number <span style="color: #859900;">(</span>number-at-point<span style="color: #859900;">)</span><span style="color: #268bd2;">)</span>
            <span style="color: #268bd2;">(</span>inc-by <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> arg arg 1<span style="color: #859900;">)</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span>
        <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">when</span> number
          <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
            <span style="color: #859900;">(</span>forward-word<span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span>search-backward <span style="color: #dc322f;">(</span>number-to-string number<span style="color: #dc322f;">)</span><span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span>replace-match <span style="color: #dc322f;">(</span>number-to-string <span style="color: #b58900;">(</span>+ number inc-by<span style="color: #b58900;">)</span><span style="color: #dc322f;">)</span><span style="color: #859900;">)</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/align-columns</span> <span style="color: #b58900;">(</span>start end regexp<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Align text in columns according to `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">regexp</span><span style="color: #2aa198; font-style: italic;">'"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span> <span style="color: #2aa198;">"r\nsAlign regexp: "</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>align-regexp start end
                <span style="color: #268bd2;">(</span>concat <span style="color: #2aa198;">"</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">\\s-*</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">"</span> regexp<span style="color: #268bd2;">)</span> 1 1 t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
