toby-mode.html
<div id="outline-container-orga71988f" class="outline-3">
<h3 id="orga71988f">Keymap</h3>
<div class="outline-text-3" id="text-orga71988f">
<p>
So, <code>toby-mode</code> has its own keymap.  This is what allows my
overrides to be switched off.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defvar</span> <span style="color: #268bd2;">*tobys-mode-map*</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>map <span style="color: #cb4b16;">(</span>make-sparse-keymap<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-x m"</span><span style="color: #dc322f;">)</span>      'eshell<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"M-g"</span><span style="color: #dc322f;">)</span>        'goto-line<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"s-z"</span><span style="color: #dc322f;">)</span>        'undo<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"M-z"</span><span style="color: #dc322f;">)</span>        'zap-to-char<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-x \\"</span><span style="color: #dc322f;">)</span>     'align-regexp<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-x \|"</span><span style="color: #dc322f;">)</span>     'toby/align-columns<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"M-/"</span><span style="color: #dc322f;">)</span>        'hippie-expand<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"s-/"</span><span style="color: #dc322f;">)</span>        'hippie-expand<span style="color: #268bd2;">)</span>

    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-S-d"</span><span style="color: #dc322f;">)</span>      'duplicate-line<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-RET"</span><span style="color: #dc322f;">)</span>      'toby/open-line<span style="color: #268bd2;">)</span>

    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"H-t"</span><span style="color: #dc322f;">)</span>        'peepopen-goto-file-gui<span style="color: #268bd2;">)</span>
    <span style="color: #586e75;">;; </span><span style="color: #586e75;">Watch out! This can crash an Emacs session with a frame inside</span>
    <span style="color: #586e75;">;; </span><span style="color: #586e75;">a terminal.</span>
    <span style="color: #586e75;">;;    </span><span style="color: #586e75;">(define-key map (kbd "M-O")        'ns-open-file-using-panel)</span>

    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"S-s-&lt;up&gt;"</span><span style="color: #dc322f;">)</span>   'move-text-up<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"S-s-&lt;down&gt;"</span><span style="color: #dc322f;">)</span> 'move-text-down<span style="color: #268bd2;">)</span>

    <span style="color: #268bd2;">(</span>define-key map <span style="color: #dc322f;">[</span>f5<span style="color: #dc322f;">]</span> 'touch<span style="color: #268bd2;">)</span>
    map<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Keymap used for my local customizations."</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>define-key *tobys-mode-map* <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c C-a"</span><span style="color: #b58900;">)</span> 'toby/increment-number-at-point<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
