org-init/toby-mode.org
** Overlays

   In some languages, I find code with compressed parenthesis to be
   more difficult to read.  For example:
   #+BEGIN_SRC ruby :tangle no
   def wazzit(even,say,here)
     function_call(or_is_it, argument?)
   end
   #+END_SRC

   I suppose I could play with different fonts to find one that shifts
   the parenthesis glyph outward, but I like the font I use.
   Fortunately, Emacs provides.  Emacs Overlays can change the display
   of a buffer without changing its representation on disk.

   So, I have an overlay that can /temporarily/ add spaces within
   parenthesis:
   #+BEGIN_SRC emacs-lisp
     (defun toby/set-overlay-properties ()
       (put 'toby-open-parenthesis 'evaporate t)
       (put 'toby-open-parenthesis 'after-string " ")

       (put 'toby-close-parenthesis 'evaporate t)
       (put 'toby-close-parenthesis 'before-string " ")

       (put 'toby-rocket 'evaporate t)
       (put 'toby-rocket 'after-string " ")
       (put 'toby-rocket 'before-string " ")
       )

     (toby/set-overlay-properties)

     (defun toby/make-overlay (beg end &optional category)
       "Create and return an overlay over the given region. Category
     defaults to `toby'."
       (let ((overlay (make-overlay beg end)))
         (overlay-put overlay 'category (or category 'toby))
         overlay))

     (defun toby/my-overlay-p (overlay)
       "Return whether the given overlay is one of mine."
       (memq (overlay-get overlay 'category)
             '(toby-open-parenthesis toby-close-parenthesis toby-rocket)))

     (defun toby/make-roomy (beg end)
       "Add spacing within compressed expressions"
       (interactive "r")
       (save-excursion
         (save-match-data
           (goto-char beg)
           (while (re-search-forward
                   "[({]\\([^[:space:])]\\)"
                   end t)
             (toby/make-overlay (match-beginning 0) (match-beginning 1)
                                'toby-open-parenthesis))

           (goto-char beg)
           (while (re-search-forward
                   "\\([^[:space:](]\\)[)}]"
                   end t)
             (toby/make-overlay (match-end 1) (match-end 0)
                                'toby-close-parenthesis))

           (goto-char beg)
           (while (re-search-forward
                   "[^[:space:]]\\(=>\\)[^[:space:]]"
                   end t)
             (toby/make-overlay (match-beginning 1) (match-end 1)
                                'toby-rocket)))))

     (defun toby/make-sloppy (beg end)
       "Return the region to its unfriendly state."
       (interactive "r")
       (dolist (o (overlays-in beg end))
         (when (toby/my-overlay-p o)
           (delete-overlay o))))

     (defun toby/on-change (beg end)
       "After change hook to update overlays"
       (let ((beg-line (save-excursion (goto-char beg) (line-beginning-position)))
             (end-line (save-excursion (goto-char end) (line-end-position))))
         (toby/make-sloppy beg-line end-line)
         (toby/make-roomy beg-line end-line)))
   #+END_SRC

