toby-mode.html

<div id="outline-container-org66fb399" class="outline-3">
<h3 id="org66fb399">Overlays</h3>
<div class="outline-text-3" id="text-org66fb399">
<p>
In some languages, I find code with compressed parenthesis to be
more difficult to read.  For example:
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">wazzit</span><span style="color: #2aa198;">(</span>even,say,here<span style="color: #2aa198;">)</span>
  function_call<span style="color: #2aa198;">(</span>or_is_it, argument?<span style="color: #2aa198;">)</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<p>
I suppose I could play with different fonts to find one that shifts
the parenthesis glyph outward, but I like the font I use.
Fortunately, Emacs provides.  Emacs Overlays can change the display
of a buffer without changing its representation on disk.
</p>

<p>
So, I have an overlay that can <i>temporarily</i> add spaces within
parenthesis:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/set-overlay-properties</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>put 'toby-open-parenthesis 'evaporate t<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put 'toby-open-parenthesis 'after-string <span style="color: #2aa198;">" "</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>put 'toby-close-parenthesis 'evaporate t<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put 'toby-close-parenthesis 'before-string <span style="color: #2aa198;">" "</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>put 'toby-rocket 'evaporate t<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put 'toby-rocket 'after-string <span style="color: #2aa198;">" "</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put 'toby-rocket 'before-string <span style="color: #2aa198;">" "</span><span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>toby/set-overlay-properties<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/make-overlay</span> <span style="color: #b58900;">(</span>beg end <span style="color: #b58900;">&amp;optional</span> category<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Create and return an overlay over the given region. Category</span>
<span style="color: #2aa198; font-style: italic;">defaults to `</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">toby</span><span style="color: #2aa198; font-style: italic;">'."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>overlay <span style="color: #cb4b16;">(</span>make-overlay beg end<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>overlay-put overlay 'category <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">or</span> category 'toby<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    overlay<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/my-overlay-p</span> <span style="color: #b58900;">(</span>overlay<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Return whether the given overlay is one of mine."</span>
  <span style="color: #b58900;">(</span>memq <span style="color: #268bd2;">(</span>overlay-get overlay 'category<span style="color: #268bd2;">)</span>
        '<span style="color: #268bd2;">(</span>toby-open-parenthesis toby-close-parenthesis toby-rocket<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/make-roomy</span> <span style="color: #b58900;">(</span>beg end<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Add spacing within compressed expressions"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span> <span style="color: #2aa198;">"r"</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">save-excursion</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">save-match-data</span>
      <span style="color: #dc322f;">(</span>goto-char beg<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">while</span> <span style="color: #cb4b16;">(</span>re-search-forward
              <span style="color: #2aa198;">"[({]</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">[:space:])]</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">"</span>
              end t<span style="color: #cb4b16;">)</span>
        <span style="color: #cb4b16;">(</span>toby/make-overlay <span style="color: #268bd2;">(</span>match-beginning 0<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>match-beginning 1<span style="color: #268bd2;">)</span>
                           'toby-open-parenthesis<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>

      <span style="color: #dc322f;">(</span>goto-char beg<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">while</span> <span style="color: #cb4b16;">(</span>re-search-forward
              <span style="color: #2aa198;">"</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">[:space:](]</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">[)}]"</span>
              end t<span style="color: #cb4b16;">)</span>
        <span style="color: #cb4b16;">(</span>toby/make-overlay <span style="color: #268bd2;">(</span>match-end 1<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>match-end 0<span style="color: #268bd2;">)</span>
                           'toby-close-parenthesis<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>

      <span style="color: #dc322f;">(</span>goto-char beg<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">while</span> <span style="color: #cb4b16;">(</span>re-search-forward
              <span style="color: #2aa198;">"[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">[:space:]]</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">=&gt;</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">[:space:]]"</span>
              end t<span style="color: #cb4b16;">)</span>
        <span style="color: #cb4b16;">(</span>toby/make-overlay <span style="color: #268bd2;">(</span>match-beginning 1<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>match-end 1<span style="color: #268bd2;">)</span>
                           'toby-rocket<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/make-sloppy</span> <span style="color: #b58900;">(</span>beg end<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Return the region to its unfriendly state."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span> <span style="color: #2aa198;">"r"</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">dolist</span> <span style="color: #268bd2;">(</span>o <span style="color: #dc322f;">(</span>overlays-in beg end<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">when</span> <span style="color: #dc322f;">(</span>toby/my-overlay-p o<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span>delete-overlay o<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/on-change</span> <span style="color: #b58900;">(</span>beg end<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"After change hook to update overlays"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>beg-line <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">save-excursion</span> <span style="color: #268bd2;">(</span>goto-char beg<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>line-beginning-position<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
        <span style="color: #dc322f;">(</span>end-line <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">save-excursion</span> <span style="color: #268bd2;">(</span>goto-char end<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>line-end-position<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>toby/make-sloppy beg-line end-line<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>toby/make-roomy beg-line end-line<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
